
# tap repositories and their packages

tap 'homebrew/core'
brew 'aom'
brew 'autoconf'
brew 'automake'
brew 'awscli'
brew 'bat'
brew 'bdw-gc'
brew 'berkeley-db'
brew 'c-ares'
brew 'carthage'
brew 'cmake'
brew 'colordiff'
brew 'colormake'
brew 'coreutils'
brew 'ctags'
brew 'direnv'
brew 'docbook'
brew 'docbook-xsl'
brew 'freetype'
brew 'gdbm'
brew 'gettext'
brew 'ghq'
brew 'git'
brew 'git-now'
brew 'git-secrets'
brew 'glib'
brew 'gmp'
brew 'gnu-getopt'
brew 'gnu-typist'
brew 'go'
brew 'guile'
brew 'htop'
brew 'hub'
brew 'hugo'
brew 'icu4c'
brew 'ipcalc'
brew 'istioctl'
brew 'jansson'
brew 'jemalloc'
brew 'jpeg'
brew 'jq'
brew 'kustomize'
brew 'libde265'
brew 'libev'
brew 'libevent'
brew 'libffi'
brew 'libheif'
brew 'libidn2'
brew 'libomp'
brew 'libpng'
brew 'libssh2'
brew 'libtasn1'
brew 'libtermkey'
brew 'libtiff'
brew 'libtool'
brew 'libunistring'
brew 'libuv'
brew 'libvterm'
brew 'libyaml'
brew 'little-cms2'
brew 'lua'
brew 'luajit'
brew 'm4'
brew 'mas'
brew 'maven'
brew 'mpdecimal'
brew 'msgpack'
brew 'ncurses'
brew 'neovim'
brew 'nettle'
brew 'nghttp2'
brew 'nkf'
brew 'nmap'
brew 'node'
brew 'nspr'
brew 'nvm'
brew 'oniguruma'
brew 'openjpeg'
brew 'openssl@1.1'
brew 'p11-kit'
brew 'pcre'
brew 'pcre2'
brew 'peco'
brew 'perl'
brew 'pkg-config'
brew 'protobuf'
brew 'pwgen'
brew 'python@3.8'
brew 'python@3.9'
brew 'rbenv'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'ruby'
brew 'ruby-build'
brew 'sbt'
brew 'serverless'
brew 'shared-mime-info'
brew 'sl'
brew 'sphinx-doc'
brew 'spidermonkey'
brew 'sqlite'
brew 'stoken'
brew 'tcl-tk'
brew 'tcpflow'
brew 'tfenv'
brew 'tflint'
brew 'the_silver_searcher'
brew 'tig'
brew 'tmux'
brew 'tree'
brew 'unibilium'
brew 'vim'
brew 'w3m'
brew 'watch'
brew 'webp'
brew 'wget'
brew 'x265'
brew 'xmlto'
brew 'xz'
brew 'yajl'
brew 'yarn'
brew 'yq'
brew 'zsh'

tap 'homebrew/bundle'

tap 'homebrew/cask-versions'
cask 'sequel-pro-nightly'

tap 'homebrew/command-not-found'

tap 'homebrew/cask'
cask 'adobe-creative-cloud'
cask 'alfred'
cask 'appcleaner'
cask 'atom'
cask 'caffeine'
cask 'clipy'
cask 'discord'
cask 'docker'
cask 'dropbox'
cask 'goland'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'insomnia'
cask 'iterm2'
cask 'karabiner-elements'
cask 'macdown'
cask 'mysqlworkbench'
cask 'notion'
cask 'postico'
cask 'skitch'
cask 'slack'
cask 'visual-studio-code'

tap 'alecthomas/tap'
brew 'gometalinter'

tap 'c-bata/kube-prompt'
brew 'kube-prompt'

tap 'minio/stable'
brew 'mc'

tap 'neovim/neovim'

tap 'rcmdnk/file'
brew 'brew-file'

tap 'remind101/formulae'

tap 'tokiwong/tap'

tap 'weaveworks/tap'

# Other Cask applications
cask 'java'
cask 'psequel'

# App Store applications
mas 'DeskApp for YouTube (1.3)', id: 1180531112
mas 'GarageBand (10.3.5)', id: 682658836
mas 'GIPHY CAPTURE (4.1)', id: 668208984
mas 'iMovie (10.2.3)', id: 408981434
mas 'Keynote (11.0.1)', id: 409183694
mas 'Magnet (2.4)', id: 441258766
mas 'Memory Diag (2.4.8)', id: 748212890
mas 'Numbers (11.0)', id: 409203825
mas 'Pages (11.0)', id: 409201541
mas 'Pocket (1.8.6)', id: 568494494
mas 'TweetDeck (3.18)', id: 485812721
