
# tap repositories and their packages

tap 'homebrew/core'
brew 'amazon-ecs-cli'
brew 'autoconf'
brew 'automake'
brew 'aws-elasticbeanstalk'
brew 'awscli'
brew 'bat'
brew 'bdw-gc'
brew 'carthage'
brew 'cmake'
brew 'colordiff'
brew 'colormake'
brew 'coreutils'
brew 'cowsay'
brew 'ctags'
brew 'dep'
brew 'direnv'
brew 'freetype'
brew 'gdbm'
brew 'gettext'
brew 'ghq'
brew 'git'
brew 'git-now'
brew 'glide'
brew 'gmp'
brew 'gnu-getopt'
brew 'gnu-typist'
brew 'go'
brew 'helmfile'
brew 'htop'
brew 'hub'
brew 'hugo'
brew 'icu4c'
brew 'imagemagick'
brew 'istioctl'
brew 'jemalloc'
brew 'jpeg'
brew 'jq'
brew 'kubernetes-cli', args: ['link:', 'false']
brew 'libevent'
brew 'libpng'
brew 'libtermkey'
brew 'libtiff'
brew 'libtool'
brew 'libuv'
brew 'libvterm'
brew 'libyaml'
brew 'lua'
brew 'luajit'
brew 'mas'
brew 'maven'
brew 'msgpack'
brew 'neovim'
brew 'nettle'
brew 'nkf'
brew 'nmap'
brew 'node'
brew 'nspr'
brew 'nvm'
brew 'oniguruma'
brew 'openssl@1.1'
brew 'pcre'
brew 'peco'
brew 'pkg-config'
brew 'protobuf'
brew 'pwgen'
brew 'python@3.8'
brew 'rbenv'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'ruby-build'
brew 'sbt'
brew 'serverless'
brew 'sl'
brew 'spidermonkey'
brew 'sqlite'
brew 'stoken'
brew 'tcpflow'
brew 'terraform'
brew 'tfenv', args: ['force']
brew 'the_silver_searcher'
brew 'tig'
brew 'tmux'
brew 'tree'
brew 'unibilium'
brew 'vim'
brew 'w3m'
brew 'watch'
brew 'weaveworks/tap/eksctl'
brew 'wget'
brew 'xz'
brew 'yajl'
brew 'yarn'
brew 'yq'
brew 'zsh'

tap 'homebrew/bundle'

tap 'homebrew/cask-versions'
cask 'sequel-pro-nightly'

tap 'homebrew/command-not-found'

tap 'homebrew/cask'
cask 'adobe-creative-cloud'
cask 'anki'
cask 'atom'
cask 'clipy'
cask 'discord'
cask 'dropbox'
cask 'flux'
cask 'google-chrome'
cask 'insomnia'
cask 'karabiner-elements'
cask 'mysqlworkbench'
cask 'postico'
cask 'rescuetime'
cask 'slack'
cask 'visual-studio-code'

tap 'alecthomas/tap'
brew 'alecthomas/tap/gometalinter'

tap 'c-bata/kube-prompt'
brew 'c-bata/kube-prompt/kube-prompt'

tap 'neovim/neovim'

tap 'rcmdnk/file'
brew 'rcmdnk/file/brew-file'

tap 'remind101/formulae'
brew 'remind101/formulae/assume-role'

tap 'tokiwong/tap'
brew 'helm-switcher'

tap 'weaveworks/tap'

# Other Homebrew packages
brew 'heroku'
brew 'kubernetes-helm'
brew 'openssl'
brew 'python'

# Other Cask applications
cask 'alfred'
cask 'appcleaner'
cask 'caffeine'
cask 'dash'
cask 'docker'
cask 'evernote'
cask 'goland'
cask 'google-cloud-sdk'
cask 'iterm2'
cask 'java'
cask 'macdown'
cask 'notion'
cask 'psequel'
cask 'skitch'
cask 'teamsql'

# App Store applications
mas 'DeskApp', id: YouTube",
mas 'GarageBand', id: 682658836
mas 'GIPHY', id: id:
mas 'iMovie', id: 408981434
mas 'Keynote', id: 409183694
mas 'Magnet', id: 441258766
mas 'Memory', id: id:
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Pocket', id: 568494494
mas 'TweetDeck', id: 485812721
mas 'Wunderlist', id: 410628904
